// 아래 결과는 해당 지역의 표준시에 따라 다르다.
new Date();                 // 현재 날짜

// 자바스크립트의 월은 0으로 시작합니다. 즉 0은 1월이고 1은 2월
new Date(2015, 0);                      // 2014-12-31T15:00:00.000Z      
new Date(2015, 1);                      // 2015-01-31T15:00:00.000Z
new Date(2015, 1, 14);                  // 2015-02-13T15:00:00.000Z
new Date(2015, 1, 14, 13);              // 2015-02-14T04:00:00.000Z
new Date(2015, 1, 14, 13, 30);          // 2015-02-14T04:30:00.000Z
new Date(2015, 1, 14, 13, 30, 5);       // 2015-02-14T04:30:05.000Z
new Date(2015, 1, 14, 13, 30, 5, 500);  // 2015-02-14T04:30:05.500Z

// 유닉스 타임스탬프로 날짜 생성
new Date(0);                            // 1970-01-01T00:00:00.000Z
new Date(1000);                         // 1970-01-01T00:00:01.000Z
new Date(1463443200000);                // 2016-05-17T00:00:00.000Z

// 유닉스 시간 원점 이전의 날짜를 구할 때
new Date(-365*24*60*60*1000);           // 1969-01-01T00:00:00.000Z, Wed Jan 01 1969 09:00:00 GMT+0900 (한국 표준시)

// 날짜 문자열 해석 (표준시를 기준으로 한다.)
new Date('June 14, 1903');              // 1903-06-13T15:32:08.000Z
new Date('June, 1903 GMT-0000');        // 1903-06-01T00:00:00.000Z